vvpai9/Keil/Keil_v5/ARM/Pack/.Web/AnalogDevices.ADuCM355_DFP.pdsc
<?xml version = "1.0" encoding = "UTF-8" standalone = "no" ?>
<package xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" schemaVersion="1.2" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>AnalogDevices</vendor>
  <name>ADuCM355_DFP</name>
  <url>https://download.analog.com/tools/EZBoards/ADuCM355/Releases</url>
  <description>Analog Devices ADuCM355 Device Support and Examples</description>
  <supportContact>https://www.analog.com/en/content/technical_support_page/fca.html</supportContact>
  <license>License\2023-11-17-CMDFP Click Thru SLA.rtf</license>
  <releases>
    <release version="1.0.4" date="2023-09-21">
            ADuCM356 is added.
        </release>
    <release version="1.0.3" date="2020-01-21">
            Examples added.
        </release>
    <release version="1.0.2" date="2020-01-17">
            Updated license. Updated examples.
        </release>
    <release version="1.0.1" date="2019-12-05">
            Corrected errors in examples.
        </release>
    <release version="1.0.0" date="2019-11-29">
            Initial Pack (Keil Support).
        </release>
  </releases>
  <requirements>
    <packages>
      <package name="CMSIS" vendor="ARM" version="5.3.0"/>
    </packages>
  </requirements>
  <boards>
    <board vendor="AnalogDevices" name="EVAL-ADuCM355QSPZ" revision="Rev-B" orderForm="https://www.analog.com/en/design-center/evaluation-hardware-and-software/evaluation-boards-kits/EVAL-ADuCM355.html#eb-buy">
      <description>Analog Devices ADuCM355 Evaluation Board</description>
      <mountedDevice deviceIndex="0" Dvendor="Analog Devices:1" Dname="ADuCM355"/>
      <compatibleDevice deviceIndex="0" Dvendor="Analog Devices:1" Dfamily="ADuCM355 Series"/>
      <debugInterface adapter="JTAG/SW" connector="20 pin JTAG (0.1 inch connector)"/>
      <debugInterface adapter="USB-SWD/UART-EMUZ" connector="8 pin (proprietary ADI)"/>
    </board>
  </boards>
  <keywords>
    <keyword>Analog Devices</keyword>
    <keyword>Device Support</keyword>
    <keyword>Device Family Package Analog Devices</keyword>
    <keyword>ADuCM355</keyword>
    <keyword>ADuCM356</keyword>
  </keywords>
  <devices>
    <family Dfamily="ADuCM355 Series" Dvendor="Analog Devices:1">
      <description>
                The ADuCM355 system on a chip provides the features needed to bias and measure a range of different electrochemical sensors.
            </description>
      <environment name="uv">
        <CMisc>--C99</CMisc>
        <AMisc>--cpreproc --cpreproc_opts=-U__STDC__,-D__ASSEMBLER__</AMisc>
      </environment>
      <!-- ******************************  ADuCM355  ****************************** -->
      <device Dname="ADuCM355">
        <processor Dcore="Cortex-M3" DcoreVersion="r2p1" Dfpu="NO_FPU" Dmpu="NO_MPU" Dtz="NO_TZ" Dendian="Little-endian" Dclock="26000000"/>
        <environment name="iar">
          <file category="i79file" name="ARM/config/devices/AnalogDevices/ADuCM3xx/ADuCM355.i79"/>
        </environment>
        <debug svd="SVD/ADuCM355.svd"/>
        <memory name="IROM1" access="rw" start="0x00000000" size="0x20000" startup="1" default="1"/>
        <!-- Using USER_SRAM_MODE = 2 as default Configuration   -->
        <memory name="dRAM_always_retained_region" access="rw" start="0x20000000" size="0x02000" default="1"/>
        <memory name="dRAM_bank1_retained_region" access="rw" start="0x20002000" size="0x02000" default="1"/>
        <memory name="dRAM_bank2_retained_region" access="rw" start="0x20004000" size="0x04000"/>
        <memory name="dRAM_never_retained_region" access="rw" start="0x20040000" size="0x08000"/>
        <memory name="digital_die_registers" access="prw" start="0x40000000" size="0x45000"/>
        <memory name="afe_die_registers" access="prw" start="0x400C0800" size="0x1C00"/>
        <memory name="uart_registers" access="prw" start="0x40005000" size="0x800"/>
        <algorithm name="Flash/ADuCM355.FLM" start="0x00000000" size="0x20000" default="1"/>
        <compile header="ADuCM355/inc/ADuCM355.h"/>
      </device>
      <!-- ******************************  ADuCM356  ****************************** -->
      <device Dname="ADuCM356">
        <processor Dcore="Cortex-M3" DcoreVersion="r2p1" Dfpu="NO_FPU" Dmpu="NO_MPU" Dtz="NO_TZ" Dendian="Little-endian" Dclock="26000000"/>
        <environment name="iar">
          <file category="i79file" name="ARM/config/devices/AnalogDevices/ADuCM3xx/ADuCM356.i79"/>
        </environment>
        <debug svd="SVD/ADuCM356.svd"/>
        <memory name="IROM1" access="rw" start="0x00000000" size="0x40000" startup="1" default="1"/>
        <!-- Using USER_SRAM_MODE = 2 as default Configuration   -->
        <memory name="dRAM_always_retained_region" access="rw" start="0x20000000" size="0x02000" default="1"/>
        <memory name="dRAM_bank1_retained_region" access="rw" start="0x20002000" size="0x02000" default="1"/>
        <memory name="dRAM_bank2_retained_region" access="rw" start="0x20004000" size="0x04000"/>
        <memory name="dRAM_never_retained_region" access="rw" start="0x20040000" size="0x08000"/>
        <memory name="digital_die_registers" access="prw" start="0x40000000" size="0x45000"/>
        <memory name="afe_die_registers" access="prw" start="0x400C0800" size="0x1C00"/>
        <memory name="uart_registers" access="prw" start="0x40005000" size="0x800"/>
        <algorithm name="Flash/ADuCM356.FLM" start="0x00000000" size="0x20000" default="1"/>
        <compile header="ADuCM355/inc/ADuCM355.h"/>
      </device>
    </family>
  </devices>
  <conditions>
    <condition id="ARMCC">
      <description>ARM Toolchain</description>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="ADuCM355">
      <description>ADuCM355 device</description>
      <require Dvendor="Analog Devices:1"/>
      <accept Dname="ADuCM355"/>
      <accept Dname="ADuCM356"/>
    </condition>
    <condition id="IAR">
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="ADuCM355_IAR">
      <description>ADuCM355 IAR</description>
      <require condition="ADuCM355"/>
      <require condition="IAR"/>
    </condition>
    <condition id="ADuCM355_ARM">
      <description>ADuCM355 ARM (Keil)</description>
      <require condition="ADuCM355"/>
      <require condition="ARMCC"/>
    </condition>
    <condition id="ADuCM355 CMSIS Device">
      <description>ADuCM355 CMSIS Device</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require condition="ADuCM355"/>
    </condition>
