vvpai9/Keil/Keil_v5/ARM/Pack/.Web/AnalogDevices.ADuCM355_DFP.pdsc
    <condition id="ADuCM355 Library">
      <description>Low Level Peripheral Libraries for ADuCM355</description>
      <require condition="ADuCM355"/>
    </condition>
    <condition id="ADuCM355 Library IntLib">
      <description>Low Level Peripheral Libraries for ADuCM355</description>
      <require condition="ADuCM355"/>
      <require Cclass="Device" Cgroup="Peripheral Libraries" Csub="INT" Cvendor="Analog Devices"/>
    </condition>
    <condition id="ADuCM355 Library RST">
      <description>Conditions for ADuCM355 RST Library</description>
      <require condition="ADuCM355"/>
      <require Cclass="Device" Cgroup="Peripheral Libraries" Csub="GPIO" Cvendor="Analog Devices"/>
    </condition>
    <condition id="ADuCM355 Library Retarget">
      <description>Conditions for ADuCM355 Retarget Library</description>
      <require condition="ADuCM355"/>
      <require Cclass="Device" Cgroup="Peripheral Libraries" Csub="UART" Cvendor="Analog Devices"/>
    </condition>
  </conditions>
  <components>
    <component Cclass="Device" Cgroup="Startup" Cversion="0.9.4" Cvendor="Analog Devices" condition="ADuCM355 CMSIS Device">
      <!-- Cversion is necessary -->
      <description>System Startup for ADuCM355</description>
      <files>
        <!-- additional include path -->
        <file category="include" name="ADuCM355/inc/"/>
        <!-- startup files -->
        <file category="source" name="ADuCM355/common/ARM/startup_ADuCM355.s" version="0.9.4" attr="config" condition="ADuCM355_ARM"/>
        <file category="source" name="ADuCM355/common/IAR/startup_ADuCM355.c" version="0.9.4" attr="config" condition="ADuCM355_IAR"/>
        <!-- system files -->
        <file category="source" name="ADuCM355/common/system_ADuCM355.c" version="0.9.4" attr="config" condition="ADuCM355"/>
        <file category="header" name="ADuCM355/inc/adi_config.h" version="0.9.4" attr="config" condition="ADuCM355"/>
        <!-- linker scripts -->
      </files>
    </component>
    <component Cclass="Device" Cgroup="Retarget UART" Cversion="0.9.4" Cvendor="Analog Devices" condition="ADuCM355 Library Retarget">
      <description>Retarget standard library I/O to UART</description>
      <files>
        <file category="source" name="ADuCM355/common/ARM/retarget.c" version="0.9.4" condition="ADuCM355_ARM"/>
        <file category="source" name="ADuCM355/common/IAR/retarget.c" version="0.9.4" condition="ADuCM355_IAR"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Peripheral Libraries" Csub="FLASH" Cversion="0.9.4" Cvendor="Analog Devices" condition="ADuCM355 Library">
      <description>Flash controller low level library for ADuCM355</description>
      <files>
        <file category="header" name="ADuCM355/common/FeeLib.h" version="0.9.4"/>
        <file category="source" name="ADuCM355/common/FeeLib.c" version="0.9.4"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Peripheral Libraries" Csub="UART" Cversion="0.9.4" Cvendor="Analog Devices" condition="ADuCM355 Library">
      <description>UART low level library for ADuCM355</description>
      <files>
        <file category="header" name="ADuCM355/common/UrtLib.h" version="0.9.4"/>
        <file category="source" name="ADuCM355/common/UrtLib.c" version="0.9.4"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Peripheral Libraries" Csub="DMA" Cversion="0.9.4" Cvendor="Analog Devices" condition="ADuCM355 Library">
      <description>DMA low level library for ADuCM355</description>
      <files>
        <file category="header" name="ADuCM355/common/DmaLib.h" version="0.9.4"/>
        <file category="source" name="ADuCM355/common/DmaLib.c" version="0.9.4"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Peripheral Libraries" Csub="GPIO" Cversion="0.9.4" Cvendor="Analog Devices" condition="ADuCM355 Library">
      <description>GPIO low level library for ADuCM355</description>
      <files>
        <file category="header" name="ADuCM355/common/DioLib.h" version="0.9.4"/>
        <file category="source" name="ADuCM355/common/DioLib.c" version="0.9.4"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Peripheral Libraries" Csub="CLOCK" Cversion="0.9.4" Cvendor="Analog Devices" condition="ADuCM355 Library">
      <description>Clock low level library for ADuCM355</description>
      <files>
        <file category="header" name="ADuCM355/common/ClkLib.h" version="0.9.4"/>
        <file category="source" name="ADuCM355/common/ClkLib.c" version="0.9.4"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Peripheral Libraries" Csub="CRC" Cversion="0.9.4" Cvendor="Analog Devices" condition="ADuCM355 Library">
      <description>CRC low level library for ADuCM355</description>
      <files>
        <file category="header" name="ADuCM355/common/CrcLib.h" version="0.9.4"/>
        <file category="source" name="ADuCM355/common/CrcLib.c" version="0.9.4"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Peripheral Libraries" Csub="Timer" Cversion="0.9.4" Cvendor="Analog Devices" condition="ADuCM355 Library">
      <description>General Purpose Timer low level library for ADuCM355</description>
      <files>
        <file category="header" name="ADuCM355/common/GptLib.h" version="0.9.4"/>
        <file category="source" name="ADuCM355/common/GptLib.c" version="0.9.4"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Peripheral Libraries" Csub="I2C" Cversion="0.9.4" Cvendor="Analog Devices" condition="ADuCM355 Library">
      <description>I2C interface low level library for ADuCM355</description>
      <files>
        <file category="header" name="ADuCM355/common/I2cLib.h" version="0.9.4"/>
        <file category="source" name="ADuCM355/common/I2cLib.c" version="0.9.4"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Peripheral Libraries" Csub="SPI" Cversion="0.9.4" Cvendor="Analog Devices" condition="ADuCM355 Library">
      <description>SPI interface low level library for ADuCM355</description>
      <files>
        <file category="header" name="ADuCM355/common/SpiLib.h" version="0.9.4"/>
        <file category="source" name="ADuCM355/common/SpiLib.c" version="0.9.4"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Peripheral Libraries" Csub="INT" Cversion="0.9.4" Cvendor="Analog Devices" condition="ADuCM355 Library">
      <description>External interrupt library for ADuCM355</description>
      <files>
        <file category="header" name="ADuCM355/common/IntLib.h" version="0.9.4"/>
        <file category="source" name="ADuCM355/common/IntLib.c" version="0.9.4"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Peripheral Libraries" Csub="PWR" Cversion="0.9.4" Cvendor="Analog Devices" condition="ADuCM355 Library">
      <description>Power Management low level library for ADuCM355</description>
      <files>
        <file category="header" name="ADuCM355/common/PwrLib.h" version="0.9.4"/>
        <file category="source" name="ADuCM355/common/PwrLib.c" version="0.9.4"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Peripheral Libraries" Csub="RST" Cversion="0.9.4" Cvendor="Analog Devices" condition="ADuCM355 Library RST">
      <description>Reset low level library for ADuCM355</description>
      <files>
        <file category="header" name="ADuCM355/common/RstLib.h" version="0.9.4"/>
        <file category="source" name="ADuCM355/common/RstLib.c" version="0.9.4"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Peripheral Libraries" Csub="RTC" Cversion="0.9.4" Cvendor="Analog Devices" condition="ADuCM355 Library">
      <description>RTC low level library for ADuCM355</description>
      <files>
        <file category="header" name="ADuCM355/common/RtcLib.h" version="0.9.4"/>
        <file category="source" name="ADuCM355/common/RtcLib.c" version="0.9.4"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="AFE" Csub="Operation" Cversion="0.9.4" Cvendor="Analog Devices" condition="ADuCM355 Library IntLib">
      <description>AFE low level library for ADuCM355</description>
      <files>
        <!-- additional include path -->
        <file category="include" name="ADuCM355/common/ad5940lib/"/>
        <file category="header" name="ADuCM355/common/ad5940lib/ad5940.h" version="0.9.4"/>
        <file category="source" name="ADuCM355/common/ad5940lib/ad5940.c" version="0.9.4"/>
        <file category="source" name="ADuCM355/common/ADuCM355Port.c" version="0.9.4"/>
      </files>
    </component>
