vvpai9/Keil/Keil_v5/ARM/Pack/.Web/AnalogDevices.ADuCM355_DFP.pdsc
    <component Cclass="Device" Cgroup="Peripheral Libraries" Csub="Watchdog" Cversion="0.9.4" Cvendor="Analog Devices" condition="ADuCM355 Library">
      <description>Watchdog low level library for ADuCM355</description>
      <files>
        <file category="header" name="ADuCM355/common/AfeWdtLib.h" version="0.9.4"/>
        <file category="source" name="ADuCM355/common/AfeWdtLib.c" version="0.9.4"/>
      </files>
    </component>
  </components>
  <examples>
    <!-- Examples go here 
    <example name="M356_GPIO" doc="Abstract.txt" folder="ADuCM355/examples/ADuCM356Examples/M356_GPIO">
      <description>Example demonstrating how to configure the ADC for Polling and FIFO mode</description>
      <board name="EVAL-ADuCM355QSPZ" vendor="AnalogDevices"/>
      <project>
        <environment name="uv" load="ARM/M356_GPIO.uvprojx"/>
        <environment name="iar" load="IAR/M356_GPIO.ewp"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="Peripheral Libraries"/>
        <category>Not provided</category>
        <keyword>\ADuCM356Examples/M356_GPIO</keyword>
      </attributes>
    </example>-->
    <example name="M356_4WireZ" doc="Abstract.txt" folder="ADuCM355/examples/ADuCM356Examples/M356_4WireZ">
      <description>Example demonstrating how to configure the ADC for Polling and FIFO mode</description>
      <board name="EVAL-ADuCM355QSPZ" vendor="AnalogDevices"/>
      <project>
        <environment name="uv" load="ARM/M356_4WireZ.uvprojx"/>
        <environment name="iar" load="IAR/M356_4WireZ.ewp"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="Peripheral Libraries"/>
        <category>Not provided</category>
        <keyword>ADuCM356Examples/M356_4WireZ</keyword>
      </attributes>
    </example>
    <example name="M356_BIOZ_2Wire" doc="Abstract.txt" folder="ADuCM355/examples/ADuCM356Examples/M356_BIOZ-2Wire">
      <description>Example application demonstrating a 2 wire impedance measurement</description>
      <board name="EVAL-ADuCM355QSPZ" vendor="AnalogDevices"/>
      <project>
        <environment name="uv" load="ARM/M356_BIOZ_2Wire.uvprojx"/>
        <environment name="iar" load="IAR/M356_BIOZ_2Wire.ewp"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="Peripheral Libraries"/>
        <category>Not provided</category>
        <keyword>ADuCM356Examples/M356_BIOZ-2Wire</keyword>
      </attributes>
    </example>
    <example name="M356_ECSns_2Sensors" doc="Abstract.txt" folder="ADuCM355/examples/ADuCM356Examples/M356_ECSns_2Sensors">
      <description>Example application demonstrating how to measure 2 EC sensors</description>
      <board name="EVAL-ADuCM355QSPZ" vendor="AnalogDevices"/>
      <project>
        <environment name="uv" load="ARM/M356_ECSns_2Sensors.uvprojx"/>
        <environment name="iar" load="IAR/M356_ECSns_2Sensors.ewp"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="Peripheral Libraries"/>
        <category>Not provided</category>
        <keyword>ADuCM356Examples/M356_ECSns_2Sensors</keyword>
      </attributes>
    </example>
    <example name="M356_ECSns_CapaTest" doc="Abstract.txt" folder="ADuCM355/examples/ADuCM356Examples/M356_ECSns_CapaTest">
      <description>Example application demonstrating how to do a chrono-amperometric measurement</description>
      <board name="EVAL-ADuCM355QSPZ" vendor="AnalogDevices"/>
      <project>
        <environment name="uv" load="ARM/M356_ECSns_CapaTest.uvprojx"/>
        <environment name="iar" load="IAR/M356_ECSns_CapaTest.ewp"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="Peripheral Libraries"/>
        <category>Not provided</category>
        <keyword>ADuCM356Examples/M356_ECSns_CapaTest</keyword>
      </attributes>
    </example>
    <example name="M356_ECSns_CycloVoltammetry" doc="Abstract.txt" folder="ADuCM355/examples/ADuCM356Examples/M356_ECSns_CycloVoltammetry">
      <description>Example applicationd demonstrating how to do a cyclic voltammetry measurement</description>
      <board name="EVAL-ADuCM355QSPZ" vendor="AnalogDevices"/>
      <project>
        <environment name="uv" load="ARM/M356_ECSns_CycloVoltammetry.uvprojx"/>
        <environment name="iar" load="IAR/M356_ECSns_CycloVoltammetry.ewp"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="Peripheral Libraries"/>
        <category>Not provided</category>
        <keyword>ADuCM356Examples/M356_ECSns_CycloVoltammetry</keyword>
      </attributes>
    </example>
    <example name="M356_ECSns_DualWE" doc="Abstract.txt" folder="ADuCM355/examples/ADuCM356Examples/M356_ECSns_DualWE">
      <description>Example application demonstrating how to measure a dual working electrode EC sensor</description>
      <board name="EVAL-ADuCM355QSPZ" vendor="AnalogDevices"/>
      <project>
        <environment name="uv" load="ARM/M356_ECSns_DualWE.uvprojx"/>
        <environment name="iar" load="IAR/M356_ECSns_DualWE.ewp"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="Peripheral Libraries"/>
        <category>Not provided</category>
        <keyword>ADuCM356Examples/M356_ECSns_DualWE</keyword>
      </attributes>
    </example>
    <example name="M356_ECSns_EIS" doc="Abstract.txt" folder="ADuCM355/examples/ADuCM356Examples/M356_ECSns_EIS">
      <description>Example application demonstrating hopw to do an Impedance measurement on an EC sensor</description>
      <board name="EVAL-ADuCM355QSPZ" vendor="AnalogDevices"/>
      <project>
        <environment name="uv" load="ARM/M356_ECSns_EIS.uvprojx"/>
        <environment name="iar" load="IAR/M356_ECSns_EIS.ewp"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="Peripheral Libraries"/>
        <category>Not provided</category>
        <keyword>ADuCM356Examples/M356_ECSns_EIS</keyword>
      </attributes>
    </example>
    <example name="M356_ECSns_SingleWE" doc="Abstract.txt" folder="ADuCM355/examples/ADuCM356Examples/M356_ECSns_SingleWE">
      <description>Example application demonstrating how to measure a standard 3 lead EC sensor</description>
      <board name="EVAL-ADuCM355QSPZ" vendor="AnalogDevices"/>
      <project>
        <environment name="uv" load="ARM/M356_ECSns_SingleWE.uvprojx"/>
        <environment name="iar" load="IAR/M356_ECSns_SingleWE.ewp"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="Peripheral Libraries"/>
        <category>Not provided</category>
        <keyword>ADuCM356Examples/M356_ECSns_SingleWE</keyword>
      </attributes>
    </example>
    <example name="M356_EDA" doc="Abstract.txt" folder="ADuCM355/examples/ADuCM356Examples/M356_EDA">
      <description>Example application demonstrating how to do a low power impedance measurement &lt; 200Hz</description>
      <board name="EVAL-ADuCM355QSPZ" vendor="AnalogDevices"/>
      <project>
        <environment name="uv" load="ARM/M356_EDA.uvprojx"/>
        <environment name="iar" load="IAR/M356_EDA.ewp"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="Peripheral Libraries"/>
        <category>Not provided</category>
        <keyword>ADuCM356Examples/M356_EDA</keyword>
      </attributes>
    </example>
    <example name="M356_Impedance" doc="Abstract.txt" folder="ADuCM355/examples/ADuCM356Examples/M356_Impedance">
      <description>Example demonstrating how to do a standard 2 wire impedance measurement</description>
      <board name="EVAL-ADuCM355QSPZ" vendor="AnalogDevices"/>
      <project>
        <environment name="uv" load="ARM/M356_Impedance.uvprojx"/>
        <environment name="iar" load="IAR/M356_Impedance.ewp"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="Peripheral Libraries"/>
        <category>Not provided</category>
        <keyword>ADuCM356Examples/M356_Impedance</keyword>
      </attributes>
    </example>
    <example name="M356_PwrModes" doc="Abstract.txt" folder="ADuCM355/examples/ADuCM356Examples/M356_PwrModes">
      <description>Example application demonstrating the various power modes of the ADuCM355</description>
      <board name="EVAL-ADuCM355QSPZ" vendor="AnalogDevices"/>
      <project>
        <environment name="uv" load="ARM/M356_PwrModes.uvprojx"/>
        <environment name="iar" load="IAR/M356_PwrModes.ewp"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="Peripheral Libraries"/>
        <category>Not provided</category>
        <keyword>ADuCM356Examples/M356_PwrModes</keyword>
      </attributes>
    </example>
    <example name="M356_SqrWaveVoltammetry" doc="Abstract.txt" folder="ADuCM355/examples/ADuCM356Examples/M356_SqrWaveVoltammetry">
      <description>Example application demonstrating how to do a square wave voltammetery measurement</description>
      <board name="EVAL-ADuCM355QSPZ" vendor="AnalogDevices"/>
      <project>
        <environment name="uv" load="ARM/M356_SqrWaveVoltammetry.uvprojx"/>
        <environment name="iar" load="IAR/M356_SqrWaveVoltammetry.ewp"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="Peripheral Libraries"/>
        <category>Not provided</category>
        <keyword>ADuCM356Examples/M356_SqrWaveVoltammetry</keyword>
      </attributes>
    </example>
    <example name="M355_ADC" doc="Abstract.txt" folder="ADuCM355/examples/AnalogDie/M355_ADC">
      <description>Example demonstrating how to configure the ADC for Polling and FIFO mode</description>
      <board name="EVAL-ADuCM355QSPZ" vendor="AnalogDevices"/>
      <project>
        <environment name="uv" load="ARM/M355_ADC.uvprojx"/>
        <environment name="iar" load="IAR/M355_ADC.ewp"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="Peripheral Libraries"/>
        <category>Not provided</category>
        <keyword>AnalogDie/M355_ADC</keyword>
      </attributes>
    </example>
    <example name="M355_AfeWdt" doc="Abstract.txt" folder="ADuCM355/examples/AnalogDie/M355_AfeWdt">
      <description>Example demonstrating how to use the AFE Watchdog Timer</description>
      <board name="EVAL-ADuCM355QSPZ" vendor="AnalogDevices"/>
      <project>
        <environment name="uv" load="ARM/M355_AfeWdt.uvprojx"/>
        <environment name="iar" load="IAR/M355_AfeWdt.ewp"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="Peripheral Libraries"/>
        <category>Not provided</category>
        <keyword>AnalogDie/M355_AfeWdt</keyword>
      </attributes>
    </example>
    <example name="M355_DFT" doc="Abstract.txt" folder="ADuCM355/examples/AnalogDie/M355_DFT">
      <description>Example demonstrating how to configure the DFT engine</description>
      <board name="EVAL-ADuCM355QSPZ" vendor="AnalogDevices"/>
      <project>
        <environment name="uv" load="ARM/M355_DFT.uvprojx"/>
        <environment name="iar" load="IAR/M355_DFT.ewp"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="Peripheral Libraries"/>
        <category>Not provided</category>
        <keyword>AnalogDie/M355_DFT</keyword>
      </attributes>
    </example>
    <example name="M355_HSDACCal" doc="Abstract.txt" folder="ADuCM355/examples/AnalogDie/M355_HSDACCal">
      <description>Example demonstrating how to calibrate the HSDAC</description>
      <board name="EVAL-ADuCM355QSPZ" vendor="AnalogDevices"/>
      <project>
        <environment name="uv" load="ARM/M355_HSDACCal.uvprojx"/>
        <environment name="iar" load="IAR/M355_HSDACCal.ewp"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="Peripheral Libraries"/>
        <category>Not provided</category>
        <keyword>AnalogDie/M355_HSDACCal</keyword>
      </attributes>
    </example>
    <example name="M355_LPLoop" doc="Abstract.txt" folder="ADuCM355/examples/AnalogDie/M355_LPLoop">
      <description>Example demonstrating how to configure the low power potentiostat block</description>
      <board name="EVAL-ADuCM355QSPZ" vendor="AnalogDevices"/>
      <project>
        <environment name="uv" load="ARM/M355_LPLoop.uvprojx"/>
        <environment name="iar" load="IAR/M355_LPLoop.ewp"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="Peripheral Libraries"/>
        <category>Not provided</category>
        <keyword>AnalogDie/M355_LPLoop</keyword>
      </attributes>
    </example>
    <example name="M355_Temperature" doc="Abstract.txt" folder="ADuCM355/examples/AnalogDie/M355_Temperature">
      <description>Example demonstrating how to use the internal temperature sensor</description>
      <board name="EVAL-ADuCM355QSPZ" vendor="AnalogDevices"/>
      <project>
        <environment name="uv" load="ARM/M355_Temperature.uvprojx"/>
        <environment name="iar" load="IAR/M355_Temperature.ewp"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="Peripheral Libraries"/>
        <category>Not provided</category>
        <keyword>AnalogDie/M355_Temperature</keyword>
      </attributes>
    </example>
    <example name="M355_TempSensor2" doc="Abstract.txt" folder="ADuCM355/examples/AnalogDie/M355_TempSensor2">
      <description>Example demonstrating how to use the 2nd temperature sensor in the ADuCM355</description>
      <board name="EVAL-ADuCM355QSPZ" vendor="AnalogDevices"/>
      <project>
        <environment name="uv" load="ARM/M355_TempSensor2.uvprojx"/>
        <environment name="iar" load="IAR/M355_TempSensor2.ewp"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="Peripheral Libraries"/>
        <category>Not provided</category>
        <keyword>AnalogDie/M355_TempSensor2</keyword>
      </attributes>
    </example>
    <example name="M355_WaveGenerator" doc="Abstract.txt" folder="ADuCM355/examples/AnalogDie/M355_WaveformGenerator">
      <description>Example demonstrating how to configure the waveform generator</description>
      <board name="EVAL-ADuCM355QSPZ" vendor="AnalogDevices"/>
      <project>
        <environment name="uv" load="ARM/M355_WaveGenerator.uvprojx"/>
        <environment name="iar" load="IAR/M355_WaveGenerator.ewp"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="Peripheral Libraries"/>
        <category>Not provided</category>
        <keyword>AnalogDie/M355_WaveformGenerator</keyword>
      </attributes>
    </example>
    <example name="M355_4WireZ" doc="Abstract.txt" folder="ADuCM355/examples/ApplicationExamples/M355_4WireZ">
      <description>Example application demonstrating how to do a 4 wire impedance measurement</description>
      <board name="EVAL-ADuCM355QSPZ" vendor="AnalogDevices"/>
      <project>
        <environment name="uv" load="ARM/M355_4WireZ.uvprojx"/>
        <environment name="iar" load="IAR/M355_4WireZ.ewp"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="Peripheral Libraries"/>
        <category>Not provided</category>
        <keyword>ApplicationExamples/M355_4WireZ</keyword>
      </attributes>
    </example>
    <example name="M355_BIOZ_2Wire" doc="Abstract.txt" folder="ADuCM355/examples/ApplicationExamples/M355_BIOZ-2Wire">
      <description>Example application demonstrating a 2 wire impedance measurement</description>
      <board name="EVAL-ADuCM355QSPZ" vendor="AnalogDevices"/>
      <project>
        <environment name="uv" load="ARM/M355_BIOZ_2Wire.uvprojx"/>
        <environment name="iar" load="IAR/M355_BIOZ_2Wire.ewp"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="Peripheral Libraries"/>
        <category>Not provided</category>
        <keyword>ApplicationExamples/M355_BIOZ-2Wire</keyword>
      </attributes>
    </example>
    <example name="M355_ECSns_2Sensors" doc="Abstract.txt" folder="ADuCM355/examples/ApplicationExamples/M355_ECSns_2Sensors">
      <description>Example application demonstrating how to measure 2 EC sensors</description>
      <board name="EVAL-ADuCM355QSPZ" vendor="AnalogDevices"/>
      <project>
        <environment name="uv" load="ARM/M355_ECSns_2Sensors.uvprojx"/>
        <environment name="iar" load="IAR/M355_ECSns_2Sensors.ewp"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="Peripheral Libraries"/>
        <category>Not provided</category>
        <keyword>ApplicationExamples/M355_ECSns_2Sensors</keyword>
      </attributes>
    </example>
    <example name="M355_ECSns_CapaTest" doc="Abstract.txt" folder="ADuCM355/examples/ApplicationExamples/M355_ECSns_CapaTest">
      <description>Example application demonstrating how to do a chrono-amperometric measurement</description>
      <board name="EVAL-ADuCM355QSPZ" vendor="AnalogDevices"/>
      <project>
        <environment name="uv" load="ARM/M355_ECSns_CapaTest.uvprojx"/>
        <environment name="iar" load="IAR/M355_ECSns_CapaTest.ewp"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="Peripheral Libraries"/>
        <category>Not provided</category>
        <keyword>ApplicationExamples/M355_ECSns_CapaTest</keyword>
      </attributes>
    </example>
    <example name="M355_ECSns_CycloVoltammetry" doc="Abstract.txt" folder="ADuCM355/examples/ApplicationExamples/M355_ECSns_CycloVoltammetry">
      <description>Example applicationd demonstrating how to do a cyclic voltammetry measurement</description>
      <board name="EVAL-ADuCM355QSPZ" vendor="AnalogDevices"/>
      <project>
        <environment name="uv" load="ARM/M355_ECSns_CycloVoltammetry.uvprojx"/>
        <environment name="iar" load="IAR/M355_ECSns_CycloVoltammetry.ewp"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="Peripheral Libraries"/>
        <category>Not provided</category>
        <keyword>ApplicationExamples/M355_ECSns_CycloVoltammetry</keyword>
      </attributes>
    </example>
    <example name="M355_ECSns_DualWE" doc="Abstract.txt" folder="ADuCM355/examples/ApplicationExamples/M355_ECSns_DualWE">
      <description>Example application demonstrating how to measure a dual working electrode EC sensor</description>
      <board name="EVAL-ADuCM355QSPZ" vendor="AnalogDevices"/>
      <project>
        <environment name="uv" load="ARM/M355_ECSns_DualWE.uvprojx"/>
        <environment name="iar" load="IAR/M355_ECSns_DualWE.ewp"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="Peripheral Libraries"/>
        <category>Not provided</category>
        <keyword>ApplicationExamples/M355_ECSns_DualWE</keyword>
      </attributes>
    </example>
    <example name="M355_ECSns_EIS" doc="Abstract.txt" folder="ADuCM355/examples/ApplicationExamples/M355_ECSns_EIS">
      <description>Example application demonstrating hopw to do an Impedance measurement on an EC sensor</description>
      <board name="EVAL-ADuCM355QSPZ" vendor="AnalogDevices"/>
      <project>
        <environment name="uv" load="ARM/M355_ECSns_EIS.uvprojx"/>
        <environment name="iar" load="IAR/M355_ECSns_EIS.ewp"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="Peripheral Libraries"/>
        <category>Not provided</category>
        <keyword>ApplicationExamples/M355_ECSns_EIS</keyword>
      </attributes>
    </example>
    <example name="M355_ECSns_SingleWE" doc="Abstract.txt" folder="ADuCM355/examples/ApplicationExamples/M355_ECSns_SingleWE">
      <description>Example application demonstrating how to measure a standard 3 lead EC sensor</description>
      <board name="EVAL-ADuCM355QSPZ" vendor="AnalogDevices"/>
      <project>
        <environment name="uv" load="ARM/M355_ECSns_SingleWE.uvprojx"/>
        <environment name="iar" load="IAR/M355_ECSns_SingleWE.ewp"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="Peripheral Libraries"/>
        <category>Not provided</category>
        <keyword>ApplicationExamples/M355_ECSns_SingleWE</keyword>
      </attributes>
    </example>
    <example name="M355_EDA" doc="Abstract.txt" folder="ADuCM355/examples/ApplicationExamples/M355_EDA">
      <description>Example application demonstrating how to do a low power impedance measurement &lt; 200Hz</description>
      <board name="EVAL-ADuCM355QSPZ" vendor="AnalogDevices"/>
      <project>
        <environment name="uv" load="ARM/M355_EDA.uvprojx"/>
        <environment name="iar" load="IAR/M355_EDA.ewp"/>
      </project>
      <attributes>
