vvpai9/Keil/Keil_v5/ARM/Pack/.Web/AnalogDevices.ADuCM355_DFP.pdsc
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="Peripheral Libraries"/>
        <category>Not provided</category>
        <keyword>ApplicationExamples/M355_EDA</keyword>
      </attributes>
    </example>
    <example name="M355_Impedance" doc="Abstract.txt" folder="ADuCM355/examples/ApplicationExamples/M355_Impedance">
      <description>Example demonstrating how to do a standard 2 wire impedance measurement</description>
      <board name="EVAL-ADuCM355QSPZ" vendor="AnalogDevices"/>
      <project>
        <environment name="uv" load="ARM/M355_Impedance.uvprojx"/>
        <environment name="iar" load="IAR/M355_Impedance.ewp"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="Peripheral Libraries"/>
        <category>Not provided</category>
        <keyword>ApplicationExamples/M355_Impedance</keyword>
      </attributes>
    </example>
    <example name="M355_RadiatedImmunity_Demo" doc="Abstract.txt" folder="ADuCM355/examples/ApplicationExamples/M355_RadiatedImmunity_Demo">
      <description>Example application for CN0425</description>
      <board name="EVAL-ADuCM355QSPZ" vendor="AnalogDevices"/>
      <project>
        <environment name="uv" load="ARM/M355_RadiatedImmunity_Demo.uvprojx"/>
        <environment name="iar" load="IAR/M355_RadiatedImmunity_Demo.ewp"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="Peripheral Libraries"/>
        <category>Not provided</category>
        <keyword>ApplicationExamples/M355_RadiatedImmunity_Demo</keyword>
      </attributes>
    </example>
    <example name="M355_SqrWaveVoltammetry" doc="Abstract.txt" folder="ADuCM355/examples/ApplicationExamples/M355_SqrWaveVoltammetry">
      <description>Example application demonstrating how to do a square wave voltammetery measurement</description>
      <board name="EVAL-ADuCM355QSPZ" vendor="AnalogDevices"/>
      <project>
        <environment name="uv" load="ARM/M355_SqrWaveVoltammetry.uvprojx"/>
        <environment name="iar" load="IAR/M355_SqrWaveVoltammetry.ewp"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="Peripheral Libraries"/>
        <category>Not provided</category>
        <keyword>ApplicationExamples/M355_SqrWaveVoltammetry</keyword>
      </attributes>
    </example>
    <example name="M355_PwrModes" doc="Abstract.txt" folder="ADuCM355/examples/ApplicationExamples/M355_PwrModes">
      <description>Example application demonstrating the various power modes of the ADuCM355</description>
      <board name="EVAL-ADuCM355QSPZ" vendor="AnalogDevices"/>
      <project>
        <environment name="uv" load="ARM/M355_PwrModes.uvprojx"/>
        <environment name="iar" load="IAR/M355_PwrModes.ewp"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="Peripheral Libraries"/>
        <category>Not provided</category>
        <keyword>ApplicationExamples/M355_PwrModes</keyword>
      </attributes>
    </example>
    <example name="M355_CRC" doc="Abstract.txt" folder="ADuCM355/examples/DigitalDie/M355_CRC">
      <description>Example demonstrating how to use the CRC function</description>
      <board name="EVAL-ADuCM355QSPZ" vendor="AnalogDevices"/>
      <project>
        <environment name="uv" load="ARM/M355_CRC.uvprojx"/>
        <environment name="iar" load="IAR/M355_CRC.ewp"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="Peripheral Libraries"/>
        <category>Not provided</category>
        <keyword>DigitalDie/M355_CRC</keyword>
      </attributes>
    </example>
    <example name="M355_Flash" doc="Abstract.txt" folder="ADuCM355/examples/DigitalDie/M355_Flash">
      <description>Example demonstrating how to store info in the flash</description>
      <board name="EVAL-ADuCM355QSPZ" vendor="AnalogDevices"/>
      <project>
        <environment name="uv" load="ARM/M355_Flash.uvprojx"/>
        <environment name="iar" load="IAR/M355_Flash.ewp"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="Peripheral Libraries"/>
        <category>Not provided</category>
        <keyword>DigitalDie/M355_Flash</keyword>
      </attributes>
    </example>
    <example name="M355_Flash_DMA" doc="Abstract.txt" folder="ADuCM355/examples/DigitalDie/M355_Flash_DMA">
      <description>Example demonstrating how to use DMA to move data from RAM to Flash</description>
      <board name="EVAL-ADuCM355QSPZ" vendor="AnalogDevices"/>
      <project>
        <environment name="uv" load="ARM/M355_Flash_DMA.uvprojx"/>
        <environment name="iar" load="IAR/M355_Flash_DMA.ewp"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="Peripheral Libraries"/>
        <category>Not provided</category>
        <keyword>DigitalDie/M355_Flash_DMA</keyword>
      </attributes>
    </example>
    <example name="M355_GPIO" doc="Abstract.txt" folder="ADuCM355/examples/DigitalDie/M355_GPIO">
      <description>Example demonstrating how to configure the GPIOs</description>
      <board name="EVAL-ADuCM355QSPZ" vendor="AnalogDevices"/>
      <project>
        <environment name="uv" load="ARM/M355_GPIO.uvprojx"/>
        <environment name="iar" load="IAR/M355_GPIO.ewp"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="Peripheral Libraries"/>
        <category>Not provided</category>
        <keyword>DigitalDie/M355_GPIO</keyword>
      </attributes>
    </example>
    <example name="M355_I2C_Master" doc="Abstract.txt" folder="ADuCM355/examples/DigitalDie/M355_I2C_Master">
      <description>Example demonstrating how to configure the ADuCm355 I2C master mode</description>
      <board name="EVAL-ADuCM355QSPZ" vendor="AnalogDevices"/>
      <project>
        <environment name="uv" load="ARM/M355_I2C_Master.uvprojx"/>
        <environment name="iar" load="IAR/M355_I2C_Master.ewp"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="Peripheral Libraries"/>
        <category>Not provided</category>
        <keyword>DigitalDie/M355_I2C_Master</keyword>
      </attributes>
    </example>
    <example name="M355_I2C_Slave" doc="Abstract.txt" folder="ADuCM355/examples/DigitalDie/M355_I2C_Slave">
      <description>Example demonstrating how configure the ADuCm355 I2C slave mode</description>
      <board name="EVAL-ADuCM355QSPZ" vendor="AnalogDevices"/>
      <project>
        <environment name="uv" load="ARM/M355_I2C_Slave.uvprojx"/>
        <environment name="iar" load="IAR/M355_I2C_Slave.ewp"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="Peripheral Libraries"/>
        <category>Not provided</category>
        <keyword>DigitalDie/M355_I2C_Slave</keyword>
      </attributes>
    </example>
    <example name="M355_PWM" doc="Abstract.txt" folder="ADuCM355/examples/DigitalDie/M355_PWM">
      <description>Example demonstrating how to use the AFE PWM feature</description>
      <board name="EVAL-ADuCM355QSPZ" vendor="AnalogDevices"/>
      <project>
        <environment name="uv" load="ARM/M355_PWM.uvprojx"/>
        <environment name="iar" load="IAR/M355_PWM.ewp"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="Peripheral Libraries"/>
        <category>Not provided</category>
        <keyword>DigitalDie/M355_PWM</keyword>
      </attributes>
    </example>
    <example name="M355_RTC" doc="Abstract.txt" folder="ADuCM355/examples/DigitalDie/M355_RTC">
      <description>Example demonstrating how to use the RTC </description>
      <board name="EVAL-ADuCM355QSPZ" vendor="AnalogDevices"/>
      <project>
        <environment name="uv" load="ARM/M355_RTC.uvprojx"/>
        <environment name="iar" load="IAR/M355_RTC.ewp"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="Peripheral Libraries"/>
        <category>Not provided</category>
        <keyword>DigitalDie/M355_RTC</keyword>
      </attributes>
    </example>
    <example name="M355_SPI_Master." doc="Abstract.txt" folder="ADuCM355/examples/DigitalDie/M355_SPI_Master">
      <description>Example demonstrating how to configure the ADuCM355 SPI Mastermode</description>
      <board name="EVAL-ADuCM355QSPZ" vendor="AnalogDevices"/>
      <project>
        <environment name="uv" load="ARM/M355_SPI_Master.uvprojx"/>
        <environment name="iar" load="IAR/M355_SPI_Master..ewp"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="Peripheral Libraries"/>
        <category>Not provided</category>
        <keyword>DigitalDie/M355_SPI_Master</keyword>
      </attributes>
    </example>
    <example name="M355_SPI_Slave" doc="Abstract.txt" folder="ADuCM355/examples/DigitalDie/M355_SPI_Slave">
      <description>Example demonstrating how to configure the ADuCM355 SPI Slave mode</description>
      <board name="EVAL-ADuCM355QSPZ" vendor="AnalogDevices"/>
      <project>
        <environment name="uv" load="ARM/M355_SPI_Slave.uvprojx"/>
        <environment name="iar" load="IAR/M355_SPI_Slave.ewp"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="Peripheral Libraries"/>
        <category>Not provided</category>
        <keyword>DigitalDie/M355_SPI_Slave</keyword>
      </attributes>
    </example>
    <example name="M355_Timers" doc="Abstract.txt" folder="ADuCM355/examples/DigitalDie/M355_Timers">
      <description>Example demonstrating how to configure the general purpose timers</description>
      <board name="EVAL-ADuCM355QSPZ" vendor="AnalogDevices"/>
      <project>
        <environment name="uv" load="ARM/M355_Timers.uvprojx"/>
        <environment name="iar" load="IAR/M355_Timers.ewp"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="Peripheral Libraries"/>
        <category>Not provided</category>
        <keyword>DigitalDie/M355_Timers</keyword>
      </attributes>
    </example>
    <example name="M355_Uart_FIFO" doc="Abstract.txt" folder="ADuCM355/examples/DigitalDie/M355_Uart_FIFO">
      <description>Example demonstrating how to use the UART</description>
      <board name="EVAL-ADuCM355QSPZ" vendor="AnalogDevices"/>
      <project>
        <environment name="uv" load="ARM/M355_Uart_FIFO.uvprojx"/>
        <environment name="iar" load="IAR/M355_Uart_FIFO.ewp"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="Peripheral Libraries"/>
        <category>Not provided</category>
        <keyword>DigitalDie/M355_Uart_FIFO</keyword>
      </attributes>
    </example>
    <example name="M355_Uart_Wakeup" doc="Abstract.txt" folder="ADuCM355/examples/DigitalDie/M355_UART_Wakeup">
      <description>Demonstrating how the Uart can wakeup the device</description>
      <board name="EVAL-ADuCM355QSPZ" vendor="AnalogDevices"/>
      <project>
        <environment name="uv" load="ARM/M355_Uart_Wakeup.uvprojx"/>
        <environment name="iar" load="IAR/M355_Uart_Wakeup.ewp"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="Peripheral Libraries"/>
        <category>Not provided</category>
        <keyword>DigitalDie/M355_UART_Wakeup</keyword>
      </attributes>
    </example>
  </examples>
</package>
